TOKEN = '8403510554:AAElPR25rtD1lE8WRhanOrXEfsN231DPYVc'
Names = ['Гастроном №1', 'Дом Купца Игумнова', 'Славянский базар',
         'Яръ','Кафе Пушкина','Метрополь',
         'Ресторан ЦДЛ','Чайный дом Перлова','Даниловский рынок',
         'Ресторан Обломов']
Descriptions = ['После открытия в 1953 году и до 1990 года знаменитый Гастроном ГУМа размещался на первой линии. Его мраморные прилавки и витрины, выходившие на Красную площадь, были образцом советской торговли, наглядно демонстрировали наступившее продуктовое изобилие эпохи Хрущёва.'
                ' Именно тогда в Москве появилась традиция покупать в гастрономе ГУМа продукты к семейным торжествам.\n'
'Гастроном №1 появился в 2008 году и мгновенно стал любимцем посетителей ГУМа. Объяснение простое: новый гастроном'
' очень походил на легендарный советский, о чём свидетельствуют фотографии на стенах в торговом зале. Даже названия отделов перекочевали сюда из прошлого.',

'Построен в конце XIX века. Здесь часто устраивались купеческие пиры, отражающие гастрономическую щедрость старой Москвы. Сейчас здание занимает посольство Франции.\n'
'Фасады здания выполнены в духе русской архитектуры XVII века и передают обобщённый образ боярского терема. Наружный декор архитектурного памятника отсылает к облику ярославских церквей и собора Василия Блаженного. В стилистике особняка присутствуют элементы резьбы по дереву, белому камню, металлическая ковка и литье, живопись на сводах и элементы кирпичной фигурной кладки.',

'Славянский базар — гостинично-развлекательный комплекс, располагавшийся с 1872 по 1917 год в Москве на Никольской улице. Гостиница с примыкающим полукруглым торговым корпусом была построена по проекту Роберта Гёдике. В 1873-м помещение магазина перестроено архитектором Августом Вебером, на его месте открылся первый в городе ресторан русской кухни. Подрядчиком работ выступал предприниматель Александр Пороховщиков.'
'После революции комплекс был закрыт и здание долгое время занимали разные театральные труппы. В 1966 году ресторан снова открыли, но после пожара 1993-го заведение прекратило свою работу. По состоянию на 2018 год в главном корпусе располагается Камерный музыкальный театр имени Бориса Покровского.',

'В канун 1826 года француз Транкиль Яр (фр. Tranquille Yard, имя которого и носило заведение) открыл ресторан в доме Шавана на Кузнецком мосту. Газета «Московские ведомости» сообщала, что открылась «ресторация с обеденным и ужинным столом, всякими виноградными винами и ликёрами, десертами, кофием и чаем, при весьма умеренных ценах»\n'
'Один из старейших ресторанов Москвы, открытый в 1826 году. Когда-то здесь ужинали Чехов, Шаляпин, Горький. Интерьеры сохранили дух старой России, а меню предлагает классические блюда русской кухни.',

'Несмотря на открытие в 1999 году, кафе воссоздано в стиле московской усадьбы XIX века. Атмосфера и кухня перенесут вас в эпоху Пушкина: старинные рецепты, интерьер с библиотекой и антиквариатом.',

'Единственный в своем роде зал был свидетелем многих исторических событий, сыгравших важную роль в русской истории и культуре. Витражный купол, мраморный фонтан, монументальные светильники и камерная сцена делают его лучшим местом Москвы для грандиозных торжеств. Традиции проведения банкетов, свадеб, встреч на высшем уровне в этом ресторане уже более 120 лет.'
'Расположен в легендарном отеле «Метрополь», построенном в начале XX века в стиле модерн. В его залах бывали Чехов, Блок, Шаляпин, а также иностранные дипломаты и артисты. Интерьеры сохранили роскошь дореволюционной Москвы: витражи, лепнина, росписи и огромные люстры. Сегодня предлагает блюда традиционной русской кухни — расстегаи, уху, котлеты по-киевски — в обстановке, передающей дух старой столицы.',

'Ресторан Центрального Дома литераторов – место действительно легендарное. В 1960-е здесь был знаменитый буфет для писателей со строжайшим пропускным режимом, где собирались самые известные литераторы – от Евгения Евтушенко до Беллы Ахмадулиной. Нынешний «Пестрый зал» ресторана до сих пор хранит на своих стенах автографы и рисунки писателей и поэтов «шестидесятников». Теперь ресторан Центрального Дома литераторов – это одновременно музей и место, открытое для всех, кто любит настоящую русскую кухню: простую, понятую, с интересной подачей.',

' Построен в 1893 году. Архитекторы оформили фасад в стиле шинуазри, украсив его керамическими пластинами, китайскими фонариками, драконами, рельефными панно, фиолетовым мрамором и фигурными накладными деталями. Русские буквы на вывеске стилизовали под китайские иероглифы, на крыше установили двухъярусную пагоду. Внутреннее убранство было выдержано в том же псевдокитайском духе: торговый зал декорировали позолоченной росписью, шелковыми панно, фарфоровыми статуэтками и вазами. Сегодня здесь — музей и магазин чая с историей более 130 лет.',

'Семь столетий назад святой князь Даниил, младший сын Александра Невского, строит в Москве первый монастырь — Данилов. Как это часто бывает, вблизи монастыря, на одноименной площади, разворачивается бойкая торговля. Эта ярмарка переживет всех царей и императоров, от Рюриковичей до Романовых, и в конце концов превратится в настоящий русский рынок.',

'Ресторан назван в честь героя романа Ивана Гончарова и полностью воссоздаёт атмосферу купеческой Москвы XIX века. Интерьеры оформлены как старинная усадьба — с каминами, антикварной мебелью, картинами и фарфором. Каждая деталь напоминает о спокойной, размеренной жизни старого города. В меню — традиционные блюда русской кухни по старинным рецептам: кулебяка с рыбой, уха, дичь, утка с яблоками, расстегаи и медовуха. Здесь можно не только попробовать еду, но и буквально почувствовать дух дореволюционной Москвы — уют, неторопливость и гостеприимство, которыми славились старые московские дома.']
Images = ['https://avatars.mds.yandex.net/get-altay/953593/2a00000188fd54d7cd21ad274a661c936972/orig',
          'https://avatars.dzeninfra.ru/get-zen_doc/1333513/pub_5fd777ce353faf765277f9cf_5fd7795e82e75655d10372a3/scale_1200',
          'https://avatars.dzeninfra.ru/get-zen_doc/4715514/pub_606160f3038b20790c04f212_606221654fcbbf222bb1024d/scale_1200',
          'https://showt.ru/wp-content/uploads/2017/12/2017-12-15-%D0%A8%D0%BE%D1%83%D0%A2%D0%B0%D0%B9%D0%BC_%D0%AF%D1%80%D1%8A_%D0%9C%D0%B8%D0%BD%D0%B5%D1%80%D0%B0%D0%BB-650.jpg',
          'https://i.pinimg.com/originals/47/eb/04/47eb04bf3ce6a5afc75b0bb91ac54b5a.jpg',
          'https://i.pinimg.com/originals/54/c3/d3/54c3d39c711f48e5eb09894a37b2874f.png',
          'https://thecity.m24.ru/b/d/SYketSiveY4-IvDObLLBFlFNGhtudTX-kYVfOS8Xp1Gj5pqKzWTJSFS-PsArI08gRZaK1yZktQXWesHOaOz7FWcJ5xZMng=-wWWEGAj3s375Q7BcszAxQ.jpg',
          'https://avatars.mds.yandex.net/i?id=d70fa50fb3f25b6e5352909187f26e59_l-5084109-images-thumbs&n=13',
          'https://avatars.mds.yandex.net/get-altay/10648814/2a0000018b6733f31ece3aeb59bf861e0aa0/orig',
          'https://www.gdebar.ru/data/app/bar/img/gallery/639/254134.webp']
MapLinks = ['https://yandex.ru/maps/-/CLVBmWNn', 'https://yandex.ru/maps/-/CLVBJU4-',
            'https://yandex.ru/maps/-/CLVBbPM3', 'https://yandex.ru/maps/-/CLVym-Zb',
            'https://yandex.ru/maps/-/CLVBnFZS', 'https://yandex.ru/maps/-/CLVBnRP0',
            'https://yandex.ru/maps/-/CLVBnVl1', 'https://yandex.ru/maps/-/CLVBn6im',
            'https://yandex.ru/maps/-/CLVBnKjS', 'https://yandex.ru/maps/-/CLVBn8zT']
CiteLinks = []
